<?php

function error($txt){
    static $error = array(
	
	// =========[register]==========
	'no_name' => 'لم تختر اسم المستخدم',
	'no_email' => 'لم تكتب اميل !',
	

	// ===========[home]============
	'forum0' => 'رقم المنتدى خاطئ',
    'requests' => 'الطلبات',

	// ===========[forum]============
	'forum0' => 'رقم المنتدى خاطئ',
	
	
	
	// ===========[topic]============
	
	
	
	
	// ===========[users]============
	
	
	
	
	
	// ===========[auther]============
	
	
	
	
   // ==========================================
	
	
	
   );
    return $error[$txt];
}		

	
	

?>
